Q1. List any five functions of the pandas library with execution.

Ans: Funtions of pandas:
    
1) Read Data:    
We can read data in pandas data frame as read_csv(). Two most used data read formats are csv and excel.

2)  isna
But, if one needs to get the total number of null values in a data, we can use df.isna() as below.

3) Nunique
To get the total unique values of variables, we can use df.nunique(). It will give all the unique values a variable contains.

4) Value Counts
Also to get the unique values of a single variable, we can use df.anaemia.value_counts().The resulting object will be in descending order. This function excludes NA values by default.

5) Shape, Size and Info
We can use df.shape, it gives a total number of rows and then columns. df.size() returns the number of rows times number of columns in the data frame. We can also use df.info(), from that we get different information such as rows from RangeIndex, Data columns and then data type of each column.

In [1]:
import pandas as pd
df=pd.read_csv("taxonomy.csv")
df

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       NaN                   NaN
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

In [2]:
df.isna().sum()  #Total null values

taxonomy_id     0
name            0
parent_id      11
parent_name    11
dtype: int64

In [3]:
df.nunique()   #Total no of unique value

taxonomy_id    290
name           183
parent_id       60
parent_name     50
dtype: int64

In [4]:
df.parent_name.value_counts()

Health Education              15
Skills & Training             13
Help Pay for Healthcare       12
Prevent & Treat               11
More Education                10
Support Network               10
Medical Care                   9
End-of-Life Care               8
Adoption & Foster Care         8
Help Pay for School            8
Emergency                      7
Daytime Care                   7
Care                           7
Financial Education            7
Financial Assistance           7
Advocacy & Legal Aid           7
Food                           7
Help Pay for Housing           7
Checkup & Test                 6
Health                         6
Education                      6
Emergency Cash                 6
Money                          5
Navigating the System          5
Housing                        5
Government Benefits            5
Work                           5
Goods                          5
Home Goods                     5
Addiction & Recovery           5
Legal                          5
Long-Term Housing              4
Clothing                       4
Help Pay for Transit           4
Help Pay for Work Expenses     4
Residential Care               4
Residential Housing            3
Screening & Exams              3
Support Groups                 3
Help Find Work                 2
Immediate Safety               2
Transit                        2
Help Pay for Food              2
Childcare                      2
Insurance                      2
Short-Term Housing             2
Baby Supplies                  2
Transportation                 2
Housing Advice                 2
Medical Supplies               1
Name: parent_name, dtype: int64

In [5]:
df.shape

(290, 4)

In [6]:
df.size

1160

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 290 entries, 0 to 289
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   taxonomy_id  290 non-null    object
 1   name         290 non-null    object
 2   parent_id    279 non-null    object
 3   parent_name  279 non-null    object
dtypes: object(4)
memory usage: 9.2+ KB

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [8]:
data1={
    "A":[1,2,3],
    "B":[4,5,6],
    "C":["Aman","Pooja","Sachin"]}

In [9]:
df1=pd.DataFrame(data1,index=[1,2,4])

In [10]:
df1

   A  B       C
1  1  4    Aman
2  2  5   Pooja
4  3  6  Sachin

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [11]:
import pandas as pd
data=pd.DataFrame({"Values":[10,20,30,40,50]})

In [12]:
data

   Values
0      10
1      20
2      30
3      40
4      50

In [13]:
def sum_first3(x):
    total = x.iloc[0:3].sum()
    return total

In [14]:
sum_first3(data)

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [15]:
import pandas as pd
df=pd.DataFrame({"Text":["Data Science Masters course is highly curated and uniquely designed according to the latest industry standards.","This program instills students the skills essential to knowledge discovery efforts to identify standard, novel, and truly differentiated solutions and decision-making, including skills in managing, querying, analyzing, visualizing, and extracting meaning from extremely large data sets","My self Deepa"]})

In [16]:
df

                                                Text
0  Data Science Masters course is highly curated ...
1  This program instills students the skills esse...
2                                      My self Deepa

In [17]:
def counting_words(x):
    x['Word_Count']=x['Text'].apply(lambda x:len(x.split()))
    return x

In [18]:
counting_words(df)

                                                Text  Word_Count
0  Data Science Masters course is highly curated ...          16
1  This program instills students the skills esse...          36
2                                      My self Deepa           3

Q5. How are DataFrame.size() and DataFrame.shape() different?

Ans: The size property returns the number of elements in the DataFrame. The number of elements is the number of rows * the number of columns.

The shape property returns a tuple representing the dimensionality of the DataFrame. The format of shape would be (rows, columns).

In [19]:
#Shape and size of previous dataframe
df.shape

(3, 2)

In [20]:
df.size

6

Q6. Which function of pandas do we use to read an excel file?

Ans: We can use the pandas module read_excel() function to read the excel file data into a DataFrame object.

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [21]:
df1=pd.DataFrame({"Email":["deepagupta3677@domain.com","chhavi3873@domain.com","sanjana4387@domain.com"]})

In [22]:
df1

                       Email
0  deepagupta3677@domain.com
1      chhavi3873@domain.com
2     sanjana4387@domain.com

In [23]:
def user_name(x):
    x['Username']=x['Email'].str.split('@').str[0]
    return x

In [24]:
user_name(df1)

                       Email        Username
0  deepagupta3677@domain.com  deepagupta3677
1      chhavi3873@domain.com      chhavi3873
2     sanjana4387@domain.com     sanjana4387

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [25]:
df2=pd.DataFrame({"A":[3,8,6,2,9],"B":[5,2,9,3,1],"C":[1,7,4,5,2]})

In [26]:
df2

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [27]:
def select_row(x):
    new_df=df2[(df2["A"]>5) & (df2["B"]<10)]
    return new_df

In [28]:
select_row(df2)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [29]:
df=pd.DataFrame({"Values":[2,4,2,8,5,6,7,1,9,6]})

In [30]:
df

   Values
0       2
1       4
2       2
3       8
4       5
5       6
6       7
7       1
8       9
9       6

In [31]:
df.mean()

Values    5.0
dtype: float64

In [32]:
df.median()

Values    5.5
dtype: float64

In [33]:
df.std()

Values    2.708013
dtype: float64

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [34]:
df3=pd.DataFrame({"Sales":[344,567,876,743,356,3487,364,348],
                  "Date":["2002-05-25","2003-06-24","2004-07-23","2005-03-23","2006-07-13","2006-07-13","2006-07-13","2006-07-13"]})

In [35]:
df3['Date']=pd.to_datetime(df3['Date'])   #Convert into datetime

In [36]:
df3

   Sales       Date
0    344 2002-05-25
1    567 2003-06-24
2    876 2004-07-23
3    743 2005-03-23
4    356 2006-07-13
5   3487 2006-07-13
6    364 2006-07-13
7    348 2006-07-13

In [37]:
def move_avg(x):
    #using .to_frame() to convert pandas series and close to keep only one column
    x = x['Sales'].to_frame()
    x['MovingAverage']= x['Sales'].rolling(7).mean()
    return x

In [38]:
move_avg(df3)

   Sales  MovingAverage
0    344            NaN
1    567            NaN
2    876            NaN
3    743            NaN
4    356            NaN
5   3487            NaN
6    364     962.428571
7    348     963.000000

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [39]:
df3=pd.DataFrame({"Date":["2023-01-01","2023-01-02","2023-01-03","2023-01-04","2023-01-05"]})

In [41]:
df3['Date']=pd.to_datetime(df3['Date'])   #Convert into datetime

In [42]:
df3

        Date
0 2023-01-01
1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05

In [49]:
def days(x):
    df3['Weekdays']=df3['Date'].dt.day_name()
    return df3

In [50]:
days(df3)

        Date   Weekdays
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [75]:
data=pd.DataFrame({"Date":['2023-03-27', '2022-03-28', '2023-03-29', '2022-03-30',
               '2023-03-31', '2022-01-01', '2023-04-02', '2022-04-03',
               '2023-01-04', '2022-04-05', '2023-04-06', '2022-01-07',
               '2023-01-08', '2022-01-09', '2023-01-10', '2022-04-11',
               '2023-01-12', '2022-04-13', '2023-04-14', '2022-04-15',
               '2023-01-16', '2022-01-17', '2023-01-18', '2022-01-19',
               '2023-01-20', '2022-01-21', '2023-04-22', '2022-01-23',
               '2023-01-24', '2022-04-25', '2023-01-26', '2022-01-27']})

In [76]:
data

          Date
0   2023-03-27
1   2022-03-28
2   2023-03-29
3   2022-03-30
4   2023-03-31
5   2022-01-01
6   2023-04-02
7   2022-04-03
8   2023-01-04
9   2022-04-05
10  2023-04-06
11  2022-01-07
12  2023-01-08
13  2022-01-09
14  2023-01-10
15  2022-04-11
16  2023-01-12
17  2022-04-13
18  2023-04-14
19  2022-04-15
20  2023-01-16
21  2022-01-17
22  2023-01-18
23  2022-01-19
24  2023-01-20
25  2022-01-21
26  2023-04-22
27  2022-01-23
28  2023-01-24
29  2022-04-25
30  2023-01-26
31  2022-01-27

In [79]:
def data_ranges(x):
    start_date = '2023-01-01'
    end_date = '2023-01-31'
    mask = (x['Date'] > start_date) & (x['Date'] < end_date)
    x = x.loc[mask]
    return x

In [80]:
data_ranges(data)

          Date
8   2023-01-04
12  2023-01-08
14  2023-01-10
16  2023-01-12
20  2023-01-16
22  2023-01-18
24  2023-01-20
28  2023-01-24
30  2023-01-26

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

Ans: As Pandas is dependent on the NumPy library, we need to import this dependency.Pandas module runs on top of NumPy.